{
  "personal": {
    "en": {
      "name": "Ricardo Almeida",
      "title": "Manager, Data & AI at PwC Portugal | Cloud Solution Architect",
      "location": "Lisbon, Portugal",
      "connections": "500+"
    },
    "pt": {
      "name": "Ricardo Almeida",
      "title": "Gestor de Data & IA na PwC Portugal | Arquiteto de Soluções Cloud",
      "location": "Lisboa, Portugal",
      "connections": "500+"
    },
    "profileUrl": "www.linkedin.com/in/ricardodpa"
  },
  "about": {
    "en": [
      "I'm a Data & AI lead with a passion for creating practical, AI-powered cloud-based products that blend low-code and pro-code approaches.",
      "At PwC Portugal, I lead the design and implementation of Smart Products, Automation and AI integration, including Agentic AI, Retrieval-Augmented Generation (RAG) and Conversational AI/Chatbots. I am a certified Azure and Power Platform solution architect, holding 13 Microsoft certifications across multiple services. My technical background covers a wide range, including Microsoft Power Platform, Azure, Dynamics 365, Dataverse, Python, Databricks, C#/.NET, and more. I use these skills to develop scalable AI products and automate workflows that make work easier and more efficient.",
      "Beyond my professional work, I love learning. I have a Master's in Economics and Management of Science, Technology, and Innovation, and a diverse set of interests—from philosophy and history to design, photography, and astronomy. I started a Portuguese-language podcast to share insights and dive into new areas of knowledge."
    ],
    "pt": [
      "Sou líder de Data & IA com paixão por criar produtos cloud práticos com IA que combinam abordagens low-code e pro-code.",
      "Na PwC Portugal, lidero o design e implementação de Produtos Inteligentes, Automação e integração de IA, incluindo IA Agêntica, Geração Aumentada por Recuperação (RAG) e IA Conversacional/Chatbots. Sou arquiteto de soluções certificado em Azure e Power Platform, com 13 certificações Microsoft em vários serviços. Minha formação técnica abrange várias áreas, incluindo Microsoft Power Platform, Azure, Dynamics 365, Dataverse, Python, Databricks, C#/.NET, e mais. Uso essas competências para desenvolver produtos de IA escaláveis e automatizar fluxos de trabalho que tornam o trabalho mais fácil e eficiente.",
      "Além do meu trabalho profissional, adoro aprender. Tenho um Mestrado em Economia e Gestão da Ciência, Tecnologia e Inovação, e um conjunto diversificado de interesses—desde filosofia e história até design, fotografia e astronomia. Iniciei um podcast em português para partilhar conhecimentos e explorar novas áreas de conhecimento."
    ]
  },
  "experience": [
    {
      "en": {
        "title": "Product and Cloud Lead - Data & AI team",
        "company": "PwC Portugal",
        "duration": "Jan 2024 - Present (1 yr 3 mos)",
        "location": "Lisbon, Portugal",
        "description": "Since January 2024, I have been at the helm of managing, designing, and implementing AI-focused, cloud-based solutions, including Retrieval-Augmented Generation (RAG) and integration of Large Language Models (LLMs), as a leader within PwC Portugal's Data & AI team. Our aim is to deliver top-tier AI-powered products, striking a balance between pro-code and low-code methodologies, and leveraging cloud-based deployment for scalability. I lead a team of experts, setting architectural standards and leading the orchestration of AI automation workflows. My proficiency in Microsoft Azure and Power Platform is crucial for advancing these solutions from concept to worldwide implementation."
      },
      "pt": {
        "title": "Responsável de Produto e Cloud - Equipa de Data & IA",
        "company": "PwC Portugal",
        "duration": "Jan 2024 - Presente (1 ano 3 meses)",
        "location": "Lisboa, Portugal",
        "description": "Desde janeiro de 2024, tenho estado à frente da gestão, design e implementação de soluções baseadas em cloud focadas em IA, incluindo Geração Aumentada por Recuperação (RAG) e integração de Grandes Modelos de Linguagem (LLMs), como líder dentro da equipa de Data & IA da PwC Portugal. O nosso objetivo é fornecer produtos de IA de alto nível, equilibrando metodologias pro-code e low-code, e aproveitando a implementação baseada em cloud para escalabilidade. Lidero uma equipa de especialistas, estabelecendo padrões arquitetónicos e liderando a orquestração de fluxos de trabalho de automação de IA. A minha proficiência em Microsoft Azure e Power Platform é crucial para avançar estas soluções do conceito à implementação mundial."
      }
    },
    {
      "en": {
        "title": "Cloud and Business Apps Lead - Consulting Solutions team",
        "company": "PwC Portugal",
        "duration": "Jul 2023 - Jan 2024 (7 mos)",
        "location": "Lisbon, Portugal",
        "description": "As the Cloud and Business Apps Consulting Lead, I design cutting-edge cloud architectures, having contributed to over 90 opportunities for global partners and clients. I manage a team of specialized technical consultants within a Consulting Solutions team of about 80 professionals."
      },
      "pt": {
        "title": "Responsável de Cloud e Apps de Negócio - Equipa de Soluções de Consultoria",
        "company": "PwC Portugal",
        "duration": "Jul 2023 - Jan 2024 (7 meses)",
        "location": "Lisboa, Portugal",
        "description": "Como Responsável de Consultoria em Cloud e Apps de Negócio, desenho arquiteturas cloud de ponta, tendo contribuído para mais de 90 oportunidades para parceiros e clientes globais. Giro uma equipa de consultores técnicos especializados dentro de uma equipa de Soluções de Consultoria de cerca de 80 profissionais."
      }
    },
    {
      "en": {
        "title": "Specialist - Consulting Solutions team",
        "company": "PwC Portugal",
        "duration": "Jul 2021 - Jul 2023 (2 yrs 1 mo)",
        "location": "Portugal",
        "description": "As a Microsoft Power Platform specialist, I utilize the full suite of Power Platform tools, from Canvas Apps and Power BI reports to Power Portals/Pages and Chatbots (Virtual Agents/Copilot Studio). I integrated these solutions with Azure (e.g., Functions, Logic Apps, Data Factory & Data Lake Gen2), Microsoft 365 (e.g Teams, Outlook), Dynamics 365, SQL Server, Dataverse, and SharePoint services. In addition to this expertise, I've successfully led full-stack pro-code app development projects, overseeing them from concept to delivery. Notably, I also earned PwC Portugal's first ever Hackathon as the team leader and technical specialist. This initiative has evolved into a product that we are now beginning to sell worldwide."
      },
      "pt": {
        "title": "Especialista - Equipa de Soluções de Consultoria",
        "company": "PwC Portugal",
        "duration": "Jul 2021 - Jul 2023 (2 anos 1 mês)",
        "location": "Portugal",
        "description": "Como especialista em Microsoft Power Platform, utilizo o conjunto completo de ferramentas Power Platform, desde Canvas Apps e relatórios Power BI até Power Portals/Pages e Chatbots (Virtual Agents/Copilot Studio). Integrei estas soluções com Azure (por exemplo, Functions, Logic Apps, Data Factory & Data Lake Gen2), Microsoft 365 (por exemplo, Teams, Outlook), Dynamics 365, SQL Server, Dataverse e serviços SharePoint. Além desta experiência, liderei com sucesso projetos de desenvolvimento de aplicações pro-code full-stack, supervisionando-os desde o conceito até à entrega. Notavelmente, também ganhei o primeiro Hackathon da PwC Portugal como líder de equipa e especialista técnico. Esta iniciativa evoluiu para um produto que estamos agora a começar a vender mundialmente."
      }
    },
    {
      "en": {
        "title": "Podcaster",
        "company": "Mesa do Canto - Self-employed",
        "duration": "Feb 2021 - Feb 2022 (1 yr 1 mo)",
        "location": "Lisbon, Portugal",
        "description": "\"Mesa do Canto\" is a podcast in Portuguese where two friends convene to discuss a variety of subjects, including culture, politics, philosophy, history, economics, and technology. Each episode introduces a new topic, accompanied by a succinct overview of recent news and personal recommendations for media."
      },
      "pt": {
        "title": "Podcaster",
        "company": "Mesa do Canto - Trabalho Independente",
        "duration": "Fev 2021 - Fev 2022 (1 ano 1 mês)",
        "location": "Lisboa, Portugal",
        "description": "\"Mesa do Canto\" é um podcast em português onde dois amigos se reúnem para discutir uma variedade de assuntos, incluindo cultura, política, filosofia, história, economia e tecnologia. Cada episódio introduz um novo tópico, acompanhado por uma visão sucinta das notícias recentes e recomendações pessoais de media."
      }
    },
    {
      "en": {
        "title": "Analyst",
        "company": "Avanade",
        "duration": "Dec 2020 - Jun 2021 (7 mos)",
        "location": "Lisbon, Portugal",
        "description": "In a team of six, we developed Power Platform solutions for the daily operations of over a thousand employees at a multinational corporation in Portugal. The backoffice was developed on SharePoint, with data migration from an existing database. We utilized low-code development with Power Fx and Canvas Apps, and created Power Automate Flows. I also took on team lead responsibilities and managed the backlog using Azure DevOps."
      },
      "pt": {
        "title": "Analista",
        "company": "Avanade",
        "duration": "Dez 2020 - Jun 2021 (7 meses)",
        "location": "Lisboa, Portugal",
        "description": "Numa equipa de seis, desenvolvemos soluções Power Platform para as operações diárias de mais de mil colaboradores numa corporação multinacional em Portugal. O backoffice foi desenvolvido em SharePoint, com migração de dados de uma base de dados existente. Utilizámos desenvolvimento low-code com Power Fx e Canvas Apps, e criámos Fluxos Power Automate. Também assumi responsabilidades de liderança de equipa e geri o backlog usando Azure DevOps."
      }
    },
    {
      "en": {
        "title": "Analyst",
        "company": "Avanade",
        "duration": "Apr 2020 - Dec 2020 (9 mos)",
        "description": "Software Engineering Talent Community | Full-stack development. Learning on-the-job and working with: - MVC Pattern - C# (ASP.NET) - HTML - Analytics - Reporting - Power BI"
      },
      "pt": {
        "title": "Analista",
        "company": "Avanade",
        "duration": "Abr 2020 - Dez 2020 (9 meses)",
        "description": "Comunidade de Talentos de Engenharia de Software | Desenvolvimento full-stack. Aprendizagem em contexto de trabalho e trabalho com: - Padrão MVC - C# (ASP.NET) - HTML - Analítica - Relatórios - Power BI"
      }
    },
    {
      "en": {
        "title": "Consultant",
        "company": "SPMS, EPE - Serviços Partilhados do Ministério da Saúde",
        "duration": "Oct 2018 - Mar 2020 (1 yr 6 mos)",
        "location": "Lisbon",
        "description": "Provided advisory and administrative support to the IT Directors of the Portuguese National Health System; initiated a Sharepoint website project to centralize information on company-wide projects, teams, and project managers; accountable for numerous official internal and external communications to all entities within the Portuguese National Health System; prepared manuals, process documentation, and training materials; compiled reports, Power BI reports, and meeting minutes; led teams and trained new members; managed projects and products; served as a Project Management Officer (PMO); collaborated in a 12-person team."
      },
      "pt": {
        "title": "Consultor",
        "company": "SPMS, EPE - Serviços Partilhados do Ministério da Saúde",
        "duration": "Out 2018 - Mar 2020 (1 ano 6 meses)",
        "location": "Lisboa",
        "description": "Forneci apoio consultivo e administrativo aos Diretores de TI do Sistema Nacional de Saúde Português; iniciei um projeto de website em SharePoint para centralizar informações sobre projetos, equipas e gestores de projeto da empresa; responsável por numerosas comunicações oficiais internas e externas a todas as entidades do Sistema Nacional de Saúde Português; preparei manuais, documentação de processos e materiais de formação; compilei relatórios, relatórios Power BI e atas de reunião; liderei equipas e formei novos membros; geri projetos e produtos; servi como Oficial de Gestão de Projetos (PMO); colaborei numa equipa de 12 pessoas."
      }
    }
  ],
  "education": [
    {
      "en": {
        "school": "NOVA IMS Information Management School",
        "degree": "Post-Graduate, Enterprise Data Science and Analytics",
        "duration": "Feb 2022 - Jan 2023",
        "grade": "17 (1-20)"
      },
      "pt": {
        "school": "NOVA IMS Information Management School",
        "degree": "Pós-Graduação, Enterprise Data Science and Analytics",
        "duration": "Fev 2022 - Jan 2023",
        "grade": "17 (1-20)"
      }
    },
    {
      "en": {
        "school": "ISEG - Lisbon School of Economics & Management",
        "degree": "Master's degree, Economics and Management of Science, Technology and Innovation",
        "duration": "2017 - 2020",
        "grade": "17 (1-20)",
        "thesis": "The Role of Strategic Partnerships in the Internationalization of Digital Platforms (grade: 18)"
      },
      "pt": {
        "school": "ISEG - Lisbon School of Economics & Management",
        "degree": "Mestrado, Economia e Gestão de Ciência, Tecnologia e Inovação",
        "duration": "2017 - 2020",
        "grade": "17 (1-20)",
        "thesis": "O Papel das Parcerias Estratégicas na Internacionalização de Plataformas Digitais (nota: 18)"
      }
    },
    {
      "en": {
        "school": "ISEG - Lisbon School of Economics & Management",
        "degree": "Bachelor's degree, Management",
        "duration": ""
      },
      "pt": {
        "school": "ISEG - Lisbon School of Economics & Management",
        "degree": "Licenciatura, Gestão",
        "duration": ""
      }
    }
  ],
  "certifications": [
    {
      "en": {
        "title": "Microsoft Certified: Azure Administrator Associate",
        "issuer": "Microsoft",
        "issued": "Nov 2023",
        "expires": "Nov 2024",
        "credentialID": "3ADCECC1EDEBEF55",
        "credentialURL": "https://learn.microsoft.com/en-us/users/ricardodpalmeida/credentials"
      },
      "pt": {
        "title": "Microsoft Certified: Azure Administrator Associate",
        "issuer": "Microsoft",
        "issued": "Nov 2023",
        "expires": "Nov 2024",
        "credentialID": "3ADCECC1EDEBEF55",
        "credentialURL": "https://learn.microsoft.com/en-us/users/ricardodpalmeida/credentials"
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Azure Solutions Architect Expert",
        "issuer": "Microsoft",
        "issued": "Nov 2023",
        "expires": "Nov 2024",
        "credentialID": "661603C0B2D5DDA",
        "credentialURL": "https://learn.microsoft.com/en-us/users/ricardodpalmeida/credentials"
      },
      "pt": {
        "title": "Microsoft Certified: Azure Solutions Architect Expert",
        "issuer": "Microsoft",
        "issued": "Nov 2023",
        "expires": "Nov 2024",
        "credentialID": "661603C0B2D5DDA",
        "credentialURL": "https://learn.microsoft.com/en-us/users/ricardodpalmeida/credentials"
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Azure AI Engineer Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": "https://learn.microsoft.com/en-us/users/ricardodpalmeida/credentials"
      },
      "pt": {
        "title": "Microsoft Certified: Azure AI Engineer Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": "https://learn.microsoft.com/en-us/users/ricardodpalmeida/credentials"
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Azure AI Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Azure AI Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Azure Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Azure Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Create and manage automated processes by using Power Automate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Criar e gerir processos automatizados usando Power Automate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Azure Data Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Azure Data Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Power Platform Developer Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Power Platform Developer Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Power Platform Functional Consultant Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Power Platform Functional Consultant Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Power Platform Solution Architect Expert",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Power Platform Solution Architect Expert",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "PL-600: Microsoft Power Platform Solution Architect",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "PL-600: Microsoft Power Platform Solution Architect",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Azure DevOps Fundamentals for Beginners",
        "issuer": "Udemy",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Azure DevOps Fundamentals for Beginners",
        "issuer": "Udemy",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Dynamics 365 Fundamentals (CRM)",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Dynamics 365 Fundamentals (CRM)",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Power Platform App Maker Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Power Platform App Maker Associate",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft Certified: Power Platform Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft Certified: Power Platform Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "title": "Microsoft 365 Certified: Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "title": "Microsoft 365 Certified: Fundamentals",
        "issuer": "Microsoft",
        "credentialID": "",
        "credentialURL": ""
      }
    }
  ],
  "skills": [
    {
      "en": {
        "name": "AI Solutions Architecture",
        "category": "AI",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Arquitetura de Soluções de IA",
        "category": "AI",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "RAG (Retrieval-Augmented Generation)",
        "category": "AI",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      },
      "pt": {
        "name": "RAG (Geração Aumentada por Recuperação)",
        "category": "AI",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      }
    },
    {
      "en": {
        "name": "LLM Integration",
        "category": "AI",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      },
      "pt": {
        "name": "Integração de LLM",
        "category": "AI",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      }
    },
    {
      "en": {
        "name": "Microsoft Power Platform",
        "category": "Development",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Microsoft Power Platform",
        "category": "Development",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "Azure Cloud Architecture",
        "category": "Cloud",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      },
      "pt": {
        "name": "Arquitetura Cloud Azure",
        "category": "Cloud",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      }
    },
    {
      "en": {
        "name": "Databricks",
        "category": "Data",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Databricks",
        "category": "Data",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "Product Management",
        "category": "Leadership",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Gestão de Produto",
        "category": "Leadership",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "Power BI",
        "category": "Data",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Power BI",
        "category": "Data",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "Python",
        "category": "Development",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Python",
        "category": "Development",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "Data Science",
        "category": "Data",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "Ciência de Dados",
        "category": "Data",
        "level": "Advanced",
        "credentialID": "",
        "credentialURL": ""
      }
    },
    {
      "en": {
        "name": "Low-code Development",
        "category": "Development",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      },
      "pt": {
        "name": "Desenvolvimento Low-code",
        "category": "Development",
        "level": "Expert",
        "credentialID": "",
        "credentialURL": "",
        "highlight": true
      }
    },
    {
      "en": {
        "name": "C# (ASP.NET)",
        "category": "Development",
        "level": "Intermediate",
        "credentialID": "",
        "credentialURL": ""
      },
      "pt": {
        "name": "C# (ASP.NET)",
        "category": "Development",
        "level": "Intermediate",
        "credentialID": "",
        "credentialURL": ""
      }
    }
  ],
  "languages": [
    {
      "en": {
        "language": "Portuguese",
        "proficiency": "Native proficiency"
      },
      "pt": {
        "language": "Português",
        "proficiency": "Língua materna"
      }
    },
    {
      "en": {
        "language": "English",
        "proficiency": "Full professional proficiency"
      },
      "pt": {
        "language": "Inglês",
        "proficiency": "Proficiência profissional completa"
      }
    },
    {
      "en": {
        "language": "Spanish",
        "proficiency": "Elementary proficiency"
      },
      "pt": {
        "language": "Espanhol",
        "proficiency": "Proficiência elementar"
      }
    }
  ],
  "ui": {
    "en": {
      "about": "About",
      "skills": "Skills",
      "experience": "Experience",
      "education": "Education",
      "certifications": "Certifications",
      "languages": "Languages",
      "duration": "Duration",
      "location": "Location",
      "grade": "Grade",
      "thesis": "Thesis",
      "issued": "Issued",
      "expires": "Expires",
      "credential": "Credential ID",
      "credentialId": "Credential ID",
      "verifyCertificate": "Verify Certificate"
    },
    "pt": {
      "about": "Sobre",
      "skills": "Competências",
      "experience": "Experiência",
      "education": "Educação",
      "certifications": "Certificações",
      "languages": "Idiomas",
      "duration": "Duração",
      "location": "Localização",
      "grade": "Classificação",
      "thesis": "Tese",
      "issued": "Emitido",
      "expires": "Validade",
      "credential": "ID da Credencial",
      "credentialId": "ID da Credencial",
      "verifyCertificate": "Verificar Certificado"
    }
  },
  "skillDescriptions": {
    "Low-code Development": "Creating robust applications with minimal traditional coding, using visual interfaces and pre-built components to accelerate development while maintaining flexibility and scalability.",
    "Cloud Computing": "Designing and implementing solutions leveraging distributed computing resources provided over the internet, including Infrastructure (IaaS), Platform (PaaS), and Software as a Service (SaaS).",
    "Microsoft Azure": "Building, deploying, and managing applications and services through Microsoft's cloud computing platform with expertise in AI, storage, networking, and security services.",
    "Microsoft Power Platform": "Creating business solutions using Power Apps, Power Automate, Power BI, and Power Virtual Agents to analyze data, build solutions, automate processes, and create virtual agents.",
    "Power BI": "Data visualization and business intelligence tool that transforms data from various sources into interactive dashboards and business analytics reports.",
    "Power Automate": "Cloud-based service that allows users to create automated workflows between apps and services to synchronize files, get notifications, collect data and more.",
    "Data Science": "Extracting knowledge and insights from structured and unstructured data using scientific methods, algorithms, processes, and systems.",
    "Azure AI Services": "Suite of AI services and APIs to help developers create intelligent applications without direct ML expertise, including vision, speech, language, and decision services.",
    "Cloud Architecture": "Designing high-level cloud computing systems that ensure optimal performance, reliability, security, and cost-efficiency while leveraging cloud-native capabilities.",
    "Dynamics 365": "Microsoft's line of enterprise resource planning and customer relationship management applications.",
    "Databricks": "Unified analytics platform for large-scale data processing and machine learning, optimized for Spark workloads.",
    "RAG": "Retrieval-Augmented Generation: An AI framework that enhances large language models by retrieving relevant information from external knowledge sources to generate more accurate and contextual responses.",
    "LLM Integration": "Integrating Large Language Models into applications and systems, enabling them to process, understand, and generate human-like text for various use cases.",
    "Python": "High-level programming language used for general-purpose programming, with particular strength in data analysis, machine learning, and AI applications.",
    "C#/.NET": "Programming language and framework for building web applications, services, desktop applications, and more with Microsoft technologies.",
    "Microsoft PowerPoint": "Creating professional presentations for business, educational, and technical purposes with advanced design capabilities.",
    "Microsoft Excel": "Advanced data analysis, manipulation, and visualization using features like pivot tables, formulas, and macros.",
    "Microsoft Word": "Creating professional documents with formatting, styles, and collaboration features.",
    "Business Strategy": "Developing and implementing plans to meet organizational goals, including market analysis, resource allocation, and performance evaluation.",
    "Project Management": "Planning, executing, and closing projects, ensuring they are completed on time, within budget, and meeting requirements.",
    "Communication": "Effectively conveying information through various channels to ensure understanding, build relationships, and drive action.",
    "Leadership": "Guiding and inspiring teams to achieve objectives while developing their skills and fostering a positive work environment.",
    "Product Management": "Overseeing the development and marketing of products throughout their lifecycle, from conception to retirement.",
    "Business Development": "Creating long-term value through relationship building, market opportunities, and strategic partnerships.",
    "Science Communication": "Effectively communicating complex scientific concepts to diverse audiences through various media.",
    "History": "Studying and analyzing past events to understand present circumstances and inform future decisions.",
    "SQL": "Structured Query Language for managing and manipulating relational databases, including querying, updating, and data definition.",
    "Marketing": "Promoting products or services through market research, advertising, and customer relationship management.",
    "Economics": "Analyzing the production, distribution, and consumption of goods and services to optimize resource allocation.",
    "Politics": "Understanding governance systems, public policy, and decision-making processes in organizations and societies."
  },
  "sideProjects": {
    "titles": {
      "en": {
        "section": "Side Projects",
        "podcast": "Podcast",
        "dj": "Latest Sets",
        "playlists": "My Playlists",
        "photography": "Photography"
      },
      "pt": {
        "section": "Projetos Paralelos",
        "podcast": "Podcast",
        "dj": "Sets Recentes",
        "playlists": "Minhas Playlists",
        "photography": "Fotografia"
      }
    },
    "descriptions": {
      "en": {
        "podcast": "'Mesa do Canto' was a podcast in Portuguese where a friend and I convened to discuss a variety of subjects, including culture, politics, philosophy, history, economics, and technology.",
        "dj": "I'm a DJ specializing in Jazz, African Funk and Jazz, Deep, Future, Disco and Progressive House, along with other world music like Habibi Funk. All my sets are improvised, mixing both vinyl and digital formats.",
        "photography": "Photography is a hobby that helps me appreciate the world around us. I particularly enjoy capturing the ever-changing moods of the sky, from dramatic sunsets to the interplay of clouds and light."
      },
      "pt": {
        "podcast": "'Mesa do Canto' foi um podcast em português onde eu e um amigo nos reuníamos para discutir vários assuntos, incluindo cultura, política, filosofia, história, economia e tecnologia.",
        "dj": "Sou DJ especializado em Jazz, Funk Africano, Deep, Future, Disco e Progressive House, além de outras músicas do mundo como Habibi Funk. Todos os meus sets são improvisados, misturando formatos vinil e digital.",
        "photography": "A fotografia é um hobby que me ajuda a apreciar o mundo ao nosso redor. Gosto particularmente de capturar os humores sempre mutáveis do céu, desde pores do sol dramáticos até o jogo de nuvens e luz."
      }
    },
    "embeds": {
      "podcast": {
        "src": "https://open.spotify.com/embed/show/4lj3PvhecSWd5wUJAF3Lk6?utm_source=generator&theme=0",
        "width": "100%",
        "height": "352"
      },
      "dj": [
        {
          "title": "Nadar",
          "src": "https://player-widget.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2Fricardo-almeida28%2Fnadar%2F"
        },
        {
          "title": "Fenix",
          "src": "https://player-widget.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2Fricardo-almeida28%2Ffenix%2F"
        },
        {
          "title": "Lejos",
          "src": "https://player-widget.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2Fricardo-almeida28%2Flejos%2F"
        }
      ],
      "playlists": [
        {
          "src": "https://open.spotify.com/embed/playlist/2EOgO6HyRqoFVyoS5DeGHg?utm_source=generator&theme=0",
          "title": {
            "en": "Dem beats",
            "pt": "Dem beats"
          },
          "description": {
            "en": "Mellow jazz-hop instrumentals for focus and relaxation",
            "pt": "Instrumentais suaves de jazz-hop para foco e relaxamento"
          }
        },
        {
          "src": "https://open.spotify.com/embed/playlist/0yWK4qg5GYnriJbJVVq159?utm_source=generator&theme=0",
          "title": {
            "en": "The random rock assortment",
            "pt": "A coleção aleatória de rock"
          },
          "description": {
            "en": "Essential rock tracks spanning stoner, indie, and alternative genres",
            "pt": "Faixas essenciais de rock abrangendo os géneros stoner, indie e alternativo"
          }
        },
        {
          "src": "https://open.spotify.com/embed/playlist/3YAOE2K50HfP25uBowFRJJ?utm_source=generator&theme=0",
          "title": {
            "en": "Hip hop stash",
            "pt": "Coleção de hip hop"
          },
          "description": {
            "en": "Curated collection featuring boom bap, conscious and abstract hip hop",
            "pt": "Coleção curada com boom bap, hip hop consciente e abstrato"
          }
        },
        {
          "src": "https://open.spotify.com/embed/playlist/1I43vFQgN7QBtCm8YLEJSd?utm_source=generator&theme=0",
          "title": {
            "en": "Jazz café",
            "pt": "Jazz café"
          },
          "description": {
            "en": "Timeless jazz classics and contemporary compositions",
            "pt": "Clássicos atemporais de jazz e composições contemporâneas"
          }
        }
      ]
    }
  }
} 